---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.Curve
zh: 曲线
source: html/c5f1017e-ee00-d2a9-0264-584af4a485eb.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.Curve Property

**中文**: 曲线

The definition curve of the element.

## Syntax (C#)
```csharp
public Curve Curve { get; }
```